/*現金新台幣的種類有九種：2000元、1000元、500元、200元、100元、50元、10元、5元、1元。請撰寫程式計算出支付一筆款項時所需要最少的紙鈔或硬幣。

輸入說明：輸入一數值表示支付金額(數值為整數)。

輸出說明：針對輸入值，輸出新台幣各貨幣種類所需要的個數(請依照下方範例格式進行輸出)。若輸入值為負數則輸出error。

(注意數字與符號都是半形，冒號後方請多一格空白)

範例輸入：
6666

範例輸出：
2000: 3
1000: 0
500: 1
200: 0
100: 1
50: 1
10: 1
5: 1
1: 1

*/
#include<iostream>
using namespace std;
int main(){
    int a;
    cin>>a;
    if(a<0){
        cout<<"error"<<endl;
    }
    else{
        cout<<"2000: "<<a/2000<<endl;
        a=a%2000;
        cout<<"1000: "<<a/1000<<endl;
        a=a%1000;
        cout<<"500: "<<a/500<<endl;
        a=a%500;
        cout<<"200: "<<a/200<<endl;
        a=a%200;
        cout<<"100: "<<a/100<<endl;
        a=a%100;
        cout<<"50: "<<a/50<<endl;
        a=a%50;
        cout<<"10: "<<a/10<<endl;
        a=a%10;
        cout<<"5: "<<a/5<<endl;
        a=a%5;
        cout<<"1: "<<a/1<<endl;
    }
}
