/*
有一無窮級數為 1+1/2+2/3+3/4+4/5+…，請設計程式輸入一個數n，顯示前n項所有值以及最後π的近似值，請使用for迴圈完成。(請輸出至小數點後四位)

輸入說明：根據題目輸入一個整數(int)。

輸出說明：根據題意，不需考慮任何例外狀況，輸出前n項所有值以及最後π的近似值(每十項與行尾記得換行、每項之間空一格)。

範例輸入：
50

範例輸出：
1 +1/2 +2/3 +3/4 +4/5 +5/6 +6/7 +7/8 +8/9 +9/10
+10/11 +11/12 +12/13 +13/14 +14/15 +15/16 +16/17 +17/18 +18/19 +19/20
+20/21 +21/22 +22/23 +23/24 +24/25 +25/26 +26/27 +27/28 +28/29 +29/30
+30/31 +31/32 +32/33 +33/34 +34/35 +35/36 +36/37 +37/38 +38/39 +39/40
+40/41 +41/42 +42/43 +43/44 +44/45 +45/46 +46/47 +47/48 +48/49 +49/50 =46.5008

*/


#include<iostream>
using namespace std;
int main(){
	int a,b,c,d,e;
	cin>>d;
}
