/*
Pi值無窮級數為 Pi=4-4/3+4/5-4/7+4/9-4/11+…，請設計程式輸入一個數n，顯示前n項所有值以及最後π的近似值，請使用for迴圈完成。(請輸出至小數點後五位)

輸入說明：根據題目輸入一個整數(int)。

輸出說明：根據題意，不需考慮任何例外狀況，輸出前n項所有值以及最後π的近似值(每十項與行尾記得換行、每項之間空一格)。

範例輸入：
50

範例輸出：
4 -4/3 +4/5 -4/7 +4/9 -4/11 +4/13 -4/15 +4/17 -4/19
+4/21 -4/23 +4/25 -4/27 +4/29 -4/31 +4/33 -4/35 +4/37 -4/39
+4/41 -4/43 +4/45 -4/47 +4/49 -4/51 +4/53 -4/55 +4/57 -4/59
+4/61 -4/63 +4/65 -4/67 +4/69 -4/71 +4/73 -4/75 +4/77 -4/79
+4/81 -4/83 +4/85 -4/87 +4/89 -4/91 +4/93 -4/95 +4/97 -4/99
=3.12159


*/


#include<iostream>
using namespace std;
int main(){
	int a,b,c,d,e,z;
	cin>>z;
	b=z/10;
	for(a=1;a<=b;a++){
		
		for(c=1;c<=z;c++){
			if(c%2==0){
				cout<<'-'	
			}
			else{
				cout<<'+'
			}
		}
	}
}
