/*
將會輸入兩個值，並請撰寫一支程式印出兩數之間的乘法表。

輸入說明：輸入兩個正整數(int)。

輸出說明：請根據題意，不需考慮任何例外狀況，利用for迴圈印出兩數之間的乘法表，請注意務必使用setw進行對齊。

範例輸入：
2 5

範例輸出：
2*1= 2 3*1= 3 4*1= 4 5*1= 5
2*2= 4 3*2= 6 4*2= 8 5*2=10
2*3= 6 3*3= 9 4*3=12 5*3=15
2*4= 8 3*4=12 4*4=16 5*4=20
2*5=10 3*5=15 4*5=20 5*5=25
2*6=12 3*6=18 4*6=24 5*6=30
2*7=14 3*7=21 4*7=28 5*7=35
2*8=16 3*8=24 4*8=32 5*8=40
2*9=18 3*9=27 4*9=36 5*9=45
*/


#include<iostream>
#include<iomanip>
using namespace std;
int main(){
	int a,b,c,d,e;
	cin>>a>>b;
	d=a;
	for(c=1;c<=9;c++){
		for(;d<=b;d++){
			cout<<d<<"*"<<c<<"="<<setw(2)<<d*c<<" ";
		}
		d=a;
		cout<<endl;
	}
}
