/*
請撰寫一支程式利用for迴圈印出如範例的圖形，圖形部分請以『 * 』輸出，其餘部分請以『 -』(減號) 輸出，全部符號皆為半形字。

※ 注意：僅可使用以下三個敘述輸出且各用一次 cout <<'*'; cout <<'-'; cout << endl;

範例輸出：
*-***-*
--***--
*******
*******
*******
--***--
*-***-*

*/


#include<iostream>
using namespace std;
int main(){
	int a,b,c,d,e,z;
	for(a=1;a<=7;a++){
		for(b=1;b<=7;b++){
			if(a==1&&b==2||a==1&&b==6||a==2&&b==1||a==2&&b==2||a==2&&b==6||a==2&&b==7||a==6&&b==1||a==6&&b==2||a==6&&b==6||a==6&&b==7||a==7&&b==2||a==7&&b==6){
				cout<<'-';
			}
			else{
				cout<<'*';
			}
		}
		cout<<endl;
	}
}
